
<details><summary>Show plan output</summary>

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pablosspot/test-repo-main/runs/run-ZMWhuUGuJ1wpsJAW

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.docker_run will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "docker_run"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./Dockerrun.aws.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./Dockerrun.aws.json"
      + type                = "zip"
    }

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "pablosspot.ml"
      + domain_validation_options = [
          + {
              + domain_name           = "*.pablosspot.ml"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "pablosspot.ml"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.pablosspot.ml",
        ]
      + tags                      = {
          + "created_by" = "terraform"
        }
      + tags_all                  = {
          + "created_by" = "terraform"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.validation will be created
  + resource "aws_acm_certificate_validation" "validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_elastic_beanstalk_application.eb_app will be created
  + resource "aws_elastic_beanstalk_application" "eb_app" {
      + arn         = (known after apply)
      + description = "event-driven-app beanstalk deployment"
      + id          = (known after apply)
      + name        = "event-driven-app"
      + tags        = {
          + "created_by" = "terraform"
        }
      + tags_all    = {
          + "created_by" = "terraform"
        }
    }

  # aws_elastic_beanstalk_application_version.eb_version will be created
  + resource "aws_elastic_beanstalk_application_version" "eb_version" {
      + application  = "event-driven-app"
      + arn          = (known after apply)
      + bucket       = (known after apply)
      + description  = "application version created by terraform"
      + force_delete = false
      + id           = (known after apply)
      + key          = (known after apply)
      + name         = "0bb64b32f99af42abd458d64f3decf5c35cb9be8b067464e7644cce8148a3607"
      + tags         = {
          + "created_by" = "terraform"
        }
      + tags_all     = {
          + "created_by" = "terraform"
        }
    }

  # aws_elastic_beanstalk_environment.eb_env will be created
  + resource "aws_elastic_beanstalk_environment" "eb_env" {
      + all_settings           = (known after apply)
      + application            = "event-driven-app"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = "event-driven-app"
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "event-driven-env"
      + platform_arn           = "arn:aws:elasticbeanstalk:ap-southeast-2::platform/Multi-container Docker running on 64bit Amazon Linux/2.26.4"
      + queues                 = (known after apply)
      + solution_stack_name    = (known after apply)
      + tags                   = {
          + "created_by" = "terraform"
        }
      + tags_all               = {
          + "created_by" = "terraform"
        }
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = "0bb64b32f99af42abd458d64f3decf5c35cb9be8b067464e7644cce8148a3607"
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "AWS_DEFAULT_REGION"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "ap-southeast-2"
        }
      + setting {
          + name      = "BROKER_TYPE"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "sqs"
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "internet facing"
        }
      + setting {
          + name      = "HealthCheckPath"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "/docs"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "event-driven-ec2-profile"
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t2.micro"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elbv2:listener:default"
          + value     = "false"
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      + setting {
          + name      = "MatcherHTTPCode"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "200"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "2"
        }
      + setting {
          + name      = "MinInstancesInService"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + value     = "1"
        }
      + setting {
          + name      = "Protocol"
          + namespace = "aws:elbv2:listener:443"
          + value     = "HTTPS"
        }
      + setting {
          + name      = "QUEUE_NAME"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "event-driven-queue"
        }
      + setting {
          + name      = "S3_BUCKET_NAME"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "event-driven-thumbnail-bucket"
        }
      + setting {
          + name      = "SSLCertificateArns"
          + namespace = "aws:elbv2:listener:443"
          + value     = (known after apply)
        }
      + setting {
          + name      = "SSLPolicy"
          + namespace = "aws:elbv2:listener:443"
          + value     = "ELBSecurityPolicy-TLS-1-2-Ext-2018-06"
        }
      + setting {
          + name      = "StreamLogs"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + value     = "true"
        }
      + setting {
          + name      = "THUMBNAIL_BASE_URL"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
    }

  # aws_iam_instance_profile.ec2_eb_profile will be created
  + resource "aws_iam_instance_profile" "ec2_eb_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "event-driven-ec2-profile"
      + path        = "/"
      + role        = "event-driven-ec2-role"
      + tags        = {
          + "created_by" = "terraform"
        }
      + tags_all    = {
          + "created_by" = "terraform"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker",
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier",
          + "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier",
          + "arn:aws:iam::aws:policy/EC2InstanceProfileForImageBuilderECRContainerBuilds",
        ]
      + max_session_duration  = 3600
      + name                  = "event-driven-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by" = "terraform"
        }
      + tags_all              = {
          + "created_by" = "terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "eb-application-permissions"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:*",
                              + "sqs:*",
                              + "s3:*",
                              + "ec2messages:*",
                              + "ec2:DescribeInstanceStatus",
                              + "cloudwatch:PutMetricData",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_route53_record.endpoint will be created
  + resource "aws_route53_record" "endpoint" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "app"
      + type            = "A"
      + zone_id         = "Z08086882KIXUWHTYU1K1"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = "Z2PCDNR3VC2G1N"
        }
    }

  # aws_route53_record.validation_record["*.pablosspot.ml"] will be created
  + resource "aws_route53_record" "validation_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08086882KIXUWHTYU1K1"
    }

  # aws_route53_record.validation_record["pablosspot.ml"] will be created
  + resource "aws_route53_record" "validation_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08086882KIXUWHTYU1K1"
    }

  # aws_s3_bucket.docker_run_bucket will be created
  + resource "aws_s3_bucket" "docker_run_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "docker-run-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by" = "terraform"
        }
      + tags_all                    = {
          + "created_by" = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.thumbnail_bucket will be created
  + resource "aws_s3_bucket" "thumbnail_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "event-driven-thumbnail-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by" = "terraform"
        }
      + tags_all                    = {
          + "created_by" = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_object.docker_run_object will be created
  + resource "aws_s3_bucket_object" "docker_run_object" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "0bb64b32f99af42abd458d64f3decf5c35cb9be8b067464e7644cce8148a3607.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./Dockerrun.aws.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "created_by" = "terraform"
        }
      + tags_all               = {
          + "created_by" = "terraform"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.public_read will be created
  + resource "aws_s3_bucket_policy" "public_read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_sqs_queue.queue will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "event-driven-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # local_file.docker_run_config will be created
  + resource "local_file" "docker_run_config" {
      + content              = jsonencode(
            {
              + AWSEBDockerrunVersion = 2
              + containerDefinitions  = [
                  + {
                      + essential    = true
                      + image        = "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/backend:35b58edc"
                      + memory       = 128
                      + name         = "backend"
                      + portMappings = [
                          + {
                              + containerPort = 8000
                              + hostPort      = 80
                            },
                        ]
                    },
                  + {
                      + essential = true
                      + image     = "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/worker:35b58edc"
                      + memory    = 128
                      + name      = "worker"
                    },
                ]
            }
        )
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./Dockerrun.aws.json"
      + id                   = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint_url = "https://app.pablosspot.ml/docs"
```

</details>

*Pusher: @dyordsabuzo*